reading-source-code-cn.org
#+title: 阅读源代码

正如那本《Code Reading》一书中指出的那样，源代码阅读一直没有被很好的重
视：你上大学的时候有“代码阅读”这门课吗？相信没有。

* Source Insight

很多人都用过并且现在也还用着这个工具：Source Insight。不可否认，它有很
多优点：非常直观，非常容易上手，该有的功能基本上都有...

但是，它也有一些缺点：

- 是商业软件：要花钱买或者使用盗版

- 是Windows软件：在Linux下用的话需要用 Wine 虚拟。

- 可扩展性极差：如同Perl语言作者对Perl的评价，一个好的语言，应该让简单
  的事情更简单，难的事情有可能；Source Insight对难的事情（扩展性、定制
  性）基本上不可能。

- 基本是一个只读软件：想使它可写、用它来编辑源代码简直要弱爆了，跟
  Vim/Emacs等比起来。

* 开源解决方案

使用开源软件，我们可以实现Source Insight所拥有的大部分（也是最有价值的
那部分）功能。

并且能极大的超越。

* Emacs

Emacs 是一个很强悍的编辑器，基本上只有 Vim 可与之匹敌。（鄙人是一个狂热
的 Emacs 粉，但绝不是 Vim 黑）。

没错，Emacs的学习曲线可能是陡一些，但是话说回来，学会它绝对是值得的，并
且不然的话，就没意思了。

* Grep

