reading-source-code-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>阅读源代码</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="阅读源代码"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-11 00:22:56 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">阅读源代码</h1>

<p>正如那本《Code Reading》一书中指出的那样，源代码阅读一直没有被很好的重
视：你上大学的时候有“代码阅读”这门课吗？相信没有。
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Source Insight</a></li>
<li><a href="#sec-2">2 开源解决方案</a></li>
<li><a href="#sec-3">3 Emacs</a></li>
<li><a href="#sec-4">4 Grep</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Source Insight</h2>
<div class="outline-text-2" id="text-1">


<p>
很多人都用过并且现在也还用着这个工具：Source Insight。不可否认，它有很
多优点：非常直观，非常容易上手，该有的功能基本上都有&hellip;
</p>
<p>
但是，它也有一些缺点：
</p>
<ul>
<li>是商业软件：要花钱买或者使用盗版

</li>
<li>是Windows软件：在Linux下用的话需要用 Wine 虚拟。

</li>
<li>可扩展性极差：如同Perl语言作者对Perl的评价，一个好的语言，应该让简单
  的事情更简单，难的事情有可能；Source Insight对难的事情（扩展性、定制
  性）基本上不可能。

</li>
<li>基本是一个只读软件：想使它可写、用它来编辑源代码简直要弱爆了，跟
  Vim/Emacs等比起来。
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 开源解决方案</h2>
<div class="outline-text-2" id="text-2">


<p>
使用开源软件，我们可以实现Source Insight所拥有的大部分（也是最有价值的
那部分）功能。
</p>
<p>
并且能极大的超越。
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Emacs</h2>
<div class="outline-text-2" id="text-3">


<p>
Emacs 是一个很强悍的编辑器，基本上只有 Vim 可与之匹敌。（鄙人是一个狂热
的 Emacs 粉，但绝不是 Vim 黑）。
</p>
<p>
没错，Emacs的学习曲线可能是陡一些，但是话说回来，学会它绝对是值得的，并
且不然的话，就没意思了。
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Grep</h2>
<div class="outline-text-2" id="text-4">


</div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
